ci/app/Models/MitgliederModel.php

SELECT `password`
FROM `mitglieder`
WHERE `mitglieder`.`email` = 'mustermann@muster.de'
---
    public function login(){
        $this->personen = $this->db->table("mitglieder");
        $this->personen->select("password");
        $this->personen->where("mitglieder.email", $_POST["loginEmail"]);
        $result = $this->personen->get();

SELECT `id`
FROM `mitglieder`
WHERE `mitglieder`.`email` = 'mustermann@muster.de'
---
    public function getID(){
        $this->personen = $this->db->table("mitglieder");
        $this->personen->select("id");
        $this->personen->where("mitglieder.email", $_POST["loginEmail"]);
        $result = $this->personen->get();

INSERT INTO `mitglieder` (`username`, `email`, `password`) VALUES ('artur', 'artur@artur.de', '123')
---
    function add_user($username, $email, $password) {
        $personen = $this->db->table('mitglieder');
        $personen->insert(array(
            'username' => $username,
            'email' => $email,
            'password' => $password,
        ));