ci/app/Models/MitgliederModel.php

    function update_user($id){
        $this->personen = $this->db->table("mitglieder");
        $this->personen->select("*");
        $person = $this->personen->where("id", $id);
        if (isset($_POST["persCheck"])){
            $check = 1;
        }else{
            $check = 0;
        }
        $person->update(array(
            'username' => $_POST["persName"],
            'email' => $_POST["persEmail"],
            'password' => $_POST["persPassword"],
            'inProjekt' => $check,
        ));
---
UPDATE `mitglieder` SET `username` = 'max', `email` = 'max@max.de', `password` = '123', `inProjekt` = 0
WHERE `id` = '14'